#### Terraform Plan 📖

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.apis.google_project_service.artifactregistry (deposed object 62ac1743) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "google_project_service" "artifactregistry" {
      - disable_on_destroy = false -> null
      - id                 = "olist-data-portal/artifactregistry.googleapis.com" -> null
      - project            = "olist-data-portal" -> null
      - service            = "artifactregistry.googleapis.com" -> null
    }

  # module.apis.google_project_service.compute (deposed object c7bf757f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "google_project_service" "compute" {
      - disable_on_destroy = false -> null
      - id                 = "olist-data-portal/compute.googleapis.com" -> null
      - project            = "olist-data-portal" -> null
      - service            = "compute.googleapis.com" -> null
    }

  # module.apis.google_project_service.container (deposed object 3d3a2616) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "google_project_service" "container" {
      - disable_on_destroy = false -> null
      - id                 = "olist-data-portal/container.googleapis.com" -> null
      - project            = "olist-data-portal" -> null
      - service            = "container.googleapis.com" -> null
    }

  # module.apis.google_project_service.iam (deposed object 5d00d4db) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "google_project_service" "iam" {
      - disable_on_destroy = false -> null
      - id                 = "olist-data-portal/iam.googleapis.com" -> null
      - project            = "olist-data-portal" -> null
      - service            = "iam.googleapis.com" -> null
    }

  # module.apis.google_project_service.secretmanager (deposed object 80dbec5e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "google_project_service" "secretmanager" {
      - disable_on_destroy = false -> null
      - id                 = "olist-data-portal/secretmanager.googleapis.com" -> null
      - project            = "olist-data-portal" -> null
      - service            = "secretmanager.googleapis.com" -> null
    }

  # module.apis.google_project_service.servicenetworking (deposed object f50ebc44) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "google_project_service" "servicenetworking" {
      - disable_on_destroy = false -> null
      - id                 = "olist-data-portal/servicenetworking.googleapis.com" -> null
      - project            = "olist-data-portal" -> null
      - service            = "servicenetworking.googleapis.com" -> null
    }

  # module.apis.google_project_service.sqladmin (deposed object 79658b88) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "google_project_service" "sqladmin" {
      - disable_on_destroy = false -> null
      - id                 = "olist-data-portal/sqladmin.googleapis.com" -> null
      - project            = "olist-data-portal" -> null
      - service            = "sqladmin.googleapis.com" -> null
    }

  # module.kubernetes.kubernetes_config_map.workspace will be created
  + resource "kubernetes_config_map" "workspace" {
      + data = {
          + "workspace.yaml" = <<-EOT
                load_from:
                  - grpc_server:
                      host: odp-dagster-user-code
                      port: 4000
                      location_name: "dagster_project"
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "odp-workspace"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.kubernetes_ingress_v1.webserver will be created
  + resource "kubernetes_ingress_v1" "webserver" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.allow-http"            = "true"
              + "kubernetes.io/ingress.class"                 = "gce"
              + "kubernetes.io/ingress.global-static-ip-name" = "odp-dagster-ip"
            }
          + generation       = (known after apply)
          + name             = "odp-dagster-webserver-ingress"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "gce"

          + rule {
              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "odp-dagster-webserver"

                              + port {
                                  + number = 3000
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.kubernetes.kubernetes_namespace.dagster will be created
  + resource "kubernetes_namespace" "dagster" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.kubernetes_secret.database_password will be created
  + resource "kubernetes_secret" "database_password" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "odp-database-password"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.kubernetes_service.user_code will be created
  + resource "kubernetes_service" "user_code" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "dagster-user-code"
            }
          + name             = "odp-dagster-user-code"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "dagster-user-code"
            }
          + session_affinity                  = "None"
          + type                              = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 4000
              + protocol    = "TCP"
              + target_port = "4000"
            }
        }
    }

  # module.kubernetes.kubernetes_service.webserver will be created
  + resource "kubernetes_service" "webserver" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + annotations      = {
              + "cloud.google.com/neg" = jsonencode(
                    {
                      + ingress = true
                    }
                )
            }
          + generation       = (known after apply)
          + labels           = {
              + "app" = "dagster-webserver"
            }
          + name             = "odp-dagster-webserver"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "dagster-webserver"
            }
          + session_affinity                  = "None"
          + type                              = "NodePort"

          + port {
              + node_port   = (known after apply)
              + port        = 3000
              + protocol    = "TCP"
              + target_port = "3000"
            }
        }
    }

  # module.kubernetes.kubernetes_service_account.execution will be created
  + resource "kubernetes_service_account" "execution" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "odp-dagster-exec-sa-prd@olist-data-portal.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "dagster-execution-ksa"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.kubernetes_service_account.task will be created
  + resource "kubernetes_service_account" "task" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "odp-dagster-task-sa-prd@olist-data-portal.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "dagster-task-ksa"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.secret_manager.google_secret_manager_secret_version.database_password (deposed object a25355dd) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "google_secret_manager_secret_version" "database_password" {
      - create_time           = "2025-11-22T04:38:50.359318Z" -> null
      - deletion_policy       = "DELETE" -> null
      - enabled               = true -> null
      - id                    = "projects/677014132196/secrets/odp-database-password/versions/1" -> null
      - is_secret_data_base64 = false -> null
      - name                  = "projects/677014132196/secrets/odp-database-password/versions/1" -> null
      - secret                = "projects/olist-data-portal/secrets/odp-database-password" -> null
      - secret_data           = (sensitive value) -> null
      - version               = "1" -> null
    }

Plan: 8 to add, 0 to change, 8 to destroy.

```

*Pusher: @9714, Action: `pull_request`*